//#define _CRT_SECURE_NO_WARNINGS
#pragma warning(disable:4996)
#include <stdio.h>

/**
 * C语言中的运算符分为以下几种
 *
 * 1. 算术运算符
 * 2. 自增运算符，自减运算符
 * 3. 关系运算符
 * 4. 逻辑运算符
 * 5. 位运算符
 * 6. 逗号运算符
 * 7. 运算优先级
 */

/**
 * 自增运算符
 * i++ : 先用后+
 * ++i : 先加后用
 */
void increment_operator()
{
	// i++
	int i = 10;
    printf("i: %d\n", i++);

    // ++i
    i = 10;
    printf("i: %d\n", ++i);

    i = 10;
    int j = ++i; // 等同于  i = 1 + i; j = i;
    printf("j: %d\n", j);
    printf("-------------------------------------\n");
}

/**
 * 三目运算符
 */
void ternary_conditional_operator()
{
	int a, b, max;
	scanf("%d %d", &a, &b);
	max = a > b ? a : b;
	printf("max = %d\n", max);
	printf("-------------------------------------\n");
}

/* 
 * 加等运算符
 */
void add_equal_operator()
{
	int nums[] = { 1, 2, 3, 4, 5 };
	int length = sizeof(nums) / sizeof(nums[0]);
	int sum = 0 ;
	for (int i = 0; i < length; i++)
	{
		sum += nums[i];
	}
	printf("sum = %d\n", sum);
	printf("-------------------------------------\n");
}

/*
 * 乘等运算符
 */
void multiply_equal_operator()
{
	int nums[] = { 1, 2, 3, 4, 5 };
	int length = sizeof(nums) / sizeof(nums[0]);
	int sum = 1;
	for (int i = 0; i < length; i++)
	{
		sum *= nums[i];
	}
	printf("sum = %d\n", sum);
	printf("-------------------------------------\n");
}

/**
 * 取余运算符
 */
void mod_operator()
{
	int i;
	for (i = 0; i < 100; i++)
	{
		if (i % 10 == 0)
		{
			printf("\n");
		}
		printf("%4d", i);
	}

	for (i = 1; i <= 100; i++)
	{
		if (i % 10 == 1)
		{
			printf("\n");
		}
		printf("%4d", i);
	}
	printf("\n-------------------------------------\n");
}

/**
 * 位运算
 *
 * 1. 在进行位运算时，不足8位(一个字节)时需要左补0，如 8 => 1000 => 0000 1000
 * 2. 参加位运算的操作数必须是整型类型，以补码形式出现
 * 3. 左移运算时正数可能会变负数，负数也可能会变正数，主要要看使用什么数据类型接收结果，因为不同的数据类型占据的空间宽度是不同
 *    的，如果是char类型数据byte7是符号位，如果是short类型，byte15是符号位，如果是int类型，byte31是符号位
 *
 * 	  正数10左移 一位到四位 全过程
 * 	  	             二进制数        char类型  short类型
 * 	  原始数据	0000 0000 0000 1010    10       10
 * 	  左移一位	0000 0000 0001 0100    20       20
 * 	  左移两位	0000 0000 0010 1000    40       40
 * 	  左移三位	0000 0000 0101 0000    80       80
 * 	  左移四位	0000 0000 1010 0000    -96	    160
 * 
 * 	  负数-10左移 一位到四位 全过程
 * 					 二进制数        char类型  short类型
 * 	  原始数据	1111 1111 1111 0110    -10      -10
 * 	  左移一位	1111 1111 1110 1100    -20      -20
 * 	  左移两位	1111 1111 1101 1000    -40      -40
 * 	  左移三位	1111 1111 1011 0000    -80      -80
 * 	  左移四位	1111 1111 0110 0000     96	  	-160
 *			
 * 	  -10左移四位 => 获取补码 => 获取反码 => 获取原码 => 获取十进制数
 *    -10 => 转换为二进制 => 1111 1111 1111 0110 => 左移四位(得到负数补码) => 1111 1111 0110 0000 => 补码-1得到反码 => 1111 1111 0101 1111
 * 					=> 符号位不变，其他位取反得到原码 => 1000 0000 1010 0000 => 使用short类型接收(byte15为符号位) => 1010 0000 * - 1 =>  -160
 */	
void bitwise_operator()
{
	/**
	 *  15 的二进制 => 原码 0000 0000 0000 0000 0000 0000 0000 1111
	 *  		   => 反码 0000 0000 0000 0000 0000 0000 0000 1111
	 *  		   => 补码 0000 0000 0000 0000 0000 0000 0000 1111
	 *
	 * -17 的二进制 => 原码 1000 0000 0000 0000 0000 0000 0001 0001
	 * 			   => 反码 1111 1111 1111 1111 1111 1111 1110 1110
	 * 			   => 补码 1111 1111 1111 1111 1111 1111 1110 1111
	 */
	int a = 15, b = -17;
	printf("a = %d, b = %d\n", a, b);

	/**
	 * 与运算 - & - AND
	 *
	 * a   15	0000 0000 0000 0000 0000 0000 0000 1111
	 * &	&	&
	 * b  -17	1111 1111 1111 1111 1111 1111 1110 1111
	 * 		=	=
	 * 	   15	0000 0000 0000 0000 0000 0000 0000 1111
	 */
	printf("a & b = %d\n", a & b);
	// a = a & b; 可以简写为 a &= b;

	/**
	 * 与运算应用场景
	 *
	 * 迅速清零 => & 0
	 *
	 * a   15	0000 0000 0000 0000 0000 0000 0000 1111
	 * &	&	&
	 * 0    0	0000 0000 0000 0000 0000 0000 0000 0000
	 * 		=	=
	 * 	    0	0000 0000 0000 0000 0000 0000 0000 0000
	 *
	 * 保留指定位(这里保留bit1、bit2) => & 保留的指定位为1，其余的位为0
	 *     可以用来快速获取最高位，有时会作为符号位使用
	 * a   15	0000 0000 0000 0000 0000 0000 0000 1111
	 * &	&	&
	 * 0    6	0000 0000 0000 0000 0000 0000 0000 0110
	 * 		=	=
	 * 	    0	0000 0000 0000 0000 0000 0000 0000 0110
	 *
	 * 判断奇偶 => & 1
	 *
	 * a   15	0000 0000 0000 0000 0000 0000 0000 1111
	 * &	&	&
	 * 0    1	0000 0000 0000 0000 0000 0000 0000 0001
	 * 		=	=
	 * 	    0	0000 0000 0000 0000 0000 0000 0000 0001
	 */
	printf("迅速清零 a & 0 = %d\n", a & 0);
	printf("保留指定 a & 6 = %d\n", a & 6);
	printf("判断奇偶 a & 1 = %d\n", a & 1);
	printf("判断奇偶 a & 1 = %s\n", a & 1 ? "奇" : "偶");

	/**
	 * 与运算练习1
	 *
	 * 判断 0-9 哪个是奇数，哪个是偶数
	 */
	for(int i = 0; i < 10; i++)
	{
		printf("判断奇偶 %d & 1 = %s\n", i, i & 1 ? "奇" : "偶");
	}

	/**
	 * 与运算练习2
	 *
	 * 判断 0-100 哪些数可以被8整除
	 *
	 * 原理 10 进制中个位为0可以被10整除，个位和百位都为0，可以被 10*10 = 100 整除，个位、百位和千位都为0，可以被 10*10*10 = 1000 整除
	 * 原理  2 进制中bit0为0可以被2整除，bit0和bit1都为0，可以被 2*2 = 4 整除，bit0、bit1和bit2都为0，可以被 2*2*2 = 8 整除
	 * 所以这里我们可以判断 bit0、bit1、bit2是否同时为0，使用与运算保留后 bit0、bit1、bit2 ，这里与 0111(0x07)
	 */
	for(int i = 0; i < 100; i++)
	{
		if((i & 0x07) == 0)
		{
			printf("能被8整除的数 %d\n", i);
		}
	}

	/**
	 *
	 * a	8	0000 1000
	 * |	|	|
	 * b	1	0000 0001
	 * =	=	=
	 * 		9	0000 1001
	 */
	printf("a | b = %d\n", a | b);
	// a = a | b; 可以简写为 a |= b;

	/**
	 * 异或运算(不同为1，相同为0) - ^ - XOR
	 *
	 * a	8	0000 1000
	 * ^	^	^
	 * b	1	0000 0001
	 * =	=	=
	 * 		9	0000 1001
	 */
	printf("a ^ b = %d\n", a ^ b);
	// a = a ^ b; 可以简写为 a ^= b;

	/**
	 * 非运算(1为0，0为1) - ~ - NOT
	 *
	 * a	8	0000 1000
	 * ~	~	~
	 * =	=	=
	 * 		-9	1111 0001
	 */
	printf("  ~ a = %d\n", ~a);

	/**
	 * 左移运算符 - << : 相当于在原来基础上扩大一倍
	 *
	 * a	8	0000 1000
	 * <<	<<	<<
	 * 1    1   1
	 * =	=	=
	 * 		16	0001 0000
	 */
	printf("%d << 1 = %d\n", a, a << 1);
	printf("-%d << 1 = %d\n", a, -a << 1);

	/**
	 * 右移运算符 - >> : 相当于在原来基础上缩小一倍
	 *
	 * a	8	0000 1000
	 * >>	>>	>>
	 * 1    1   1
	 * =	=	=
	 * 		4	0000 0100
	 */
	printf("%d >> 1 = %d\n", a, a >> 1);
	printf("-%d >> 1 = %d\n", a, -a >> 1);
	printf("-------------------------------------\n");
}

/**
 * 位运算和逻辑运算
 *
 * 位运算不会短路，逻辑运算会短路
 */
void bitwise_operator_and_logic_operator()
{
	int a = 10, b = 20;
	if(a > b & ++b)
	{

	}
	printf("b = %d\n", b);
	printf("-------------------------------------\n");
}

/**
 * 正数左移1到4位，当左移四位时分别使用 char 和 short 接收
 */
void positive_number_left_shift()
{
	char ch = 10;
	// 左移1位
	char r1 = ch << 1;
	printf("10 << 1 = %d\n", r1);

	// 左移2位
	char r2 = ch << 2;
	printf("10 << 2 = %d\n", r2);

	// 左移3位
	char r3 = ch << 3;
	printf("10 << 3 = %d\n", r3);

	// 左移4位
	char r4 = ch << 4;
	printf("10 << 4 = %d\n", r4);

	// 左移4位，注意：这里使用shor类型来接收了，而不是使用char类型来接收，即使左移4位，也不会越界的
	short r44 = ch << 4;
	printf("10 << 4 = %d\n", r44);
	printf("-------------------------------------\n");
}

/**
 * 负数左移1到4位，当左移四位时分别使用 char 和 short 接收
 */
void negative_number_left_shift()
{
	char ch = -10;
	
	// 左移1位
	char r1 = ch << 1;
	printf("-10 << 1 = %d\n", r1);
 
	// 左移2位
	char r2 = ch << 2;
	printf("-10 << 2 = %d\n", r2);
 
	// 左移3位
	char r3 = ch << 3;
	printf("-10 << 3 = %d\n", r3);
 
	// 左移4位
	char r4 = ch << 4;
	printf("-10 << 4 = %d\n", r4);
 
	// 左移4位，注意：这里使用shor类型来接收了，而不是使用char类型来接收，即使左移4位，也不会越界的
	short r44 = ch << 4;
	printf("-10 << 4 = %d\n", r44);
	printf("-------------------------------------\n");
}
 
int main()
{
	increment_operator();
//	ternary_conditional_operator();
	add_equal_operator();
	multiply_equal_operator();
	mod_operator();
	bitwise_operator();
	bitwise_operator_and_logic_operator();
	positive_number_left_shift();
	negative_number_left_shift();
}
